{"pageProps":{"slug":"introduction","contentHtml":"\nLekh Board is an intelligent collaborative whiteboard. This is a whiteboard app with these features\n- Intelligence of recognizing user’s rough drawings and converting them into shapes and connection\n- Real time collaboration. Multiple users can draw on a shared whiteboard together. Their drawings are synced to each other in real time.\n- Cloud based. Your drawings are saved on cloud and can be accessed from anywhere and any devices\n- Cross platform. The Lekh Board is a web application which can run on a variety of platforms such as phones, tablets, desktops.\n- Shape library. The shape library of Lekh Board has shapes for various use cases. You can drag and drop them from the library to canvas.\n\n&nbsp; \n\n## Intelligence\nThe Lekh Board has an intelligent mode in which it recognizes your rough drawings and converts them into shapes and connections. At the moment, it recognizes lines, polylines, curve lines, circles, ellipses, arrows and all kinds of connection lines.  The intelligent mode enhances your drawing experience and helps you to focus on concepts you need to express rather than tools. You draw naturally and the Lekh Board magically transforms your drawings.\n\nYou can draw polylines and polygons in single or multiple strokes. You keep drawing each side of the polygon and then the Lekh Board will keep recognizing in real time. \n\n![Intelligent Drawings](/assets/blogs/introduction/drawings.gif \"Intelligent drawings\")\n\n&nbsp; \n\n## Real time collaboration\nMultiple users can draw on a shared whiteboard and their drawings are synced to each other in real time. This makes Lekh Board a perfect tool for whiteboard discussion with remote colleagues. \n\n![Collaboration](/assets/blogs/introduction/collab.gif \"Real time collaboration\")\n\n&nbsp; \n\n## Cloud based\nLekh Board is cloud based i.e. your drawings are securely stored at the cloud. Only you can access your drawings. If you want to share your drawings with other users, then you can securely share. You can decide how to share i.e. view only share or let other users to edit your drawings.\n\n&nbsp; \n\n## Cross platform\nLekh Board works on a variety of devices such as iPhone, Android phone, iPad, Android tablets, laptop and desktops. It can run on all operating systems e.g. iOS, Android, Windows, Mac and Linux. You just need a browser and internet connection to use Lekh Board. \n\n&nbsp; \n\n## Shape Library\nLekh Board has a rich shape library. The shape library provides shapes for \n- Flowcharts\n- Block Diagrams\n- Network diagrams\n- UML diagrams\n- Rapid UI wireframing\n- Various icons\n\nYou need to just open the shape library and drag drop shapes from shape library to canvas. \n\n![Diagrams](/assets/blogs/introduction/diagrams.gif \"Diagrams\")","layout":"post","updated_at":"July 10, 2021","title":"Introduction to Lekh Board"},"__N_SSG":true}