{"pageProps":{"slug":"mindmap","contentHtml":"\n# Mind Map: The First step to Creativity\n\nStriking an idea is important. At the point when the expression \"mind planning\" was authored by Tony Buzan on the BBC's Use Your Head in 1974, the manners by which we take notes, conceptualize and study changed until the end of time.\n\nEverything starts with a single idea. When we explore the idea, other things are automatically related to it, making a perfect idea. In other words, an idea is the starting point of any innovation.\n\nThe brain generates many ideas all day. Some are fruitful and some are not. When we jot down the ideas, share them with others, we get some more unique ideas that will help to make the good unique ideas. We can say discussions help to get unique thoughts.\n\nAn idea is a solution to a problem or an idea of innovation. Whatever the case it may be, it is useful for growth. Scribbling down your idea into a presentable form allows you to conceive a gist to hit your target.\n\n&nbsp;\n\n## What is mind mapping?\n\nThe mind map is a graph used to outwardly address or framework the data. It is an amazing realistic procedure you can use to decipher what's in your mind into a visual picture. Since mind planning works like the cerebrum that permits you to arrange and comprehend data quicker and better.\n\nIt is a declaration of brilliant reasoning. Accordingly, it opens the capability of the cerebrum. The brain planning configuration empowers you to handily figure out various subtleties and perceive connections among these subtleties.\n\nMind mapping can be utilized for creating, imagining, putting together, note-taking, critical thinking, dynamic, updating, and explaining your college point, so you can begin with evaluation errands. A mind map is utilized to 'conceptualize' a theme and is an incredible procedure for the learners.\n\n&nbsp;\n\nHere is an example of a mind map. This example puts down a few types of tree. \n\n![TreeTypes](/assets/resources/res/tree_types.png \"Mind map for tree types\")\n\nThe corresponding textual representation of the same information will look like\n\nTypes of Tree:\n- Oak Tree\n- Maple Tree\n- Palm Tree\n- Bonsai Tree\n- Palm Tree\n- Willow Tree\n\nIf you need to grasp this information and remember for the long term then you will find that graphics representation (i.e. mind map) is much easier to grasp and remember for the long term.\n\n&nbsp;\n\n## Benefits of mindmap\n\nThe brain can accumulate and design huge measures of data. When we marked down, it plunges the data into an ordered form, shows connections between individual thoughts, and empowers you to see the broad view at first blush. These elements additionally make mind maps an optimal instrument to introduce data to other people, make information pools, and tackle complex issues.\n\n\n- **Graphical Presentation aids in learning effortlessly:** The human mind has its limitations. It’s hard to remember all the things but easy if we organize the points in an image. \nThe Mind map gives a colorful view of our ideas that assist us to recall the points easily. Mind Maps use tone and pictures, which invigorate your creative mind; indeed, pictures are fast for the cerebrum to examine and see, accordingly making it simpler to recall. Along these lines, if you connect a picture to a watchword or expression in your guide, you will recall it by affiliation.\n\n- **Easy to understand the new concept:** Brain Mapping is a valuable procedure that supports learning, further develops data recording, shows how various realities and thoughts are connected, and improves inventive critical thinking.\nDifferent people have different learning powers. Everyone can’t be a good learner but that doesn’t mean he/she is not productive. Organize the points, visualize these points with other points, and enhance your capacity to learn.\n\n- **Learn with fun:** Raise your hands! Who can recollect every word to their main tune? This is because you're appreciating what you're taking in, which is new, novel, and fun. At the point when you're appreciating something, you're all the more profoundly put resources into it — and that advances further learning.\nOne more of the advantages of brain planning is that it assists with making that significant commitment. While making your guide, you don't simply understand data — you produce thoughts, mastermind them on a page, add tones and pictures, audit and connect ideas. It's undeniably more captivating than simply working out words or paying attention to a talk.\n\n- **Complexity turns to simplicity:** Brain planning's prevalence is a demonstration of its adequacy. They're frequently utilized for vital arranging — something complex and includes loads of parts — because they work. Indeed, the investigation discovered that brain planning assisted understudies with arranging their papers and activities all the more successfully, working on the quality, design, and rationality of their composed work.\n\n- **Make you appealable:** Brain maps work on your capacity to review data, which is a reward concerning introducing work. Testing questions are a lot simpler to answer when the data is profoundly installed.\nBrain maps additionally help your crowd. Various investigations have discovered that matching words with pictures rejuvenates ideas and helps understanding, which assists you with making yourself clear more vividly and makes it simpler for your crowd to learn. Another investigation discovered that moderators who utilized visual language were viewed as being more clear, seriously fascinating, more solid, and more expert by their crowd than the individuals who didn't.\n\n- **Increase the efficiency level:**  Mind mapping makes it simpler to learn quicker, conceptualize quicker, and convey all the more viably. These are on the whole fundamental abilities to have in the business world: having the option to do the entirety of the above more proficiently saves you time and works on the nature of your work. Indeed, as indicated by a review by the Mind Mapping Software Blog, mind planning can support efficiency by a normal of 23%.\n\n- **Aid to be innovative:** Draw connections between thoughts, which thus can assist with horizontal reasoning — a critical piece of innovativeness. Maybe then directly working from A-B, you can hop about and associate considerations without getting sucked into straight reasoning.\n\n\nMind mapping is required in every field whether it is a marketing concern, students, manager, etc. Organizing your ideas and relating them to other points is the key to a problem-solving strategy.\n\n&nbsp;\n\n## Using Lekh App to create Mind Map\n\nUse online diagramming tools that help to build your mindmap online. This will help to focus your key points anywhere at any time. Lekh App is a diagramming tool having cloud storage, easy to use and make your mind map in minutes.\n\nLekh App has an intelligence mode which you can utilize to create a mind map very intuitively. You can draw rough shapes and the Lekh Board will recognize them. This helps you to focus on your concepts rather than on the tool itself. \n\nThere are various types of mind maps. Few of them are\n\n- **Simple mind map:** You start with a center idea. Keep the idea into a rectangle or cloud shape box. Then keep adding concepts in the form of a rectangle and connect them.\n- **Bubble map:** Similar to Simple mind map but you use circles to represent concepts.\n- **Flow Map:** You create flowchart to represent sequences of actions.\n- **Branched Mind Map:** It is like a tree. You start with a center concept and from there keep adding branches to it. \n\n&nbsp;\n\n![Simple Mind Map](/assets/resources/res/simple_mind_map.gif \"Simple Mind Map\")\n\n&nbsp;\n&nbsp;\n\n![Branched Mind Map](/assets/resources/res/branched_mind_map.gif \"Branched Mind Map\")\n\n&nbsp;\n&nbsp;\n\n![Bubble Mind Map](/assets/resources/res/bubble_mind_map.gif \"Bubble Mind Map\")","layout":"usecasemd","title":"Mind Map","imgwidth":"500px"},"__N_SSG":true}